Revit 2026 API

# ConstructionName Property

---

Get the name of the Construction.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Name { get; }
```
```vb
Public ReadOnly Property Name As String
	Get
```
```cpp
public:
property String^ Name {
	String^ get ();
}
```
```fsharp
member Name : string with get
```

#### Property Value

String

This property is used to get the name of the Construction.

#### Reference

Construction Class

Autodesk.Revit.DB Namespace